content/posts/i-patched-gsd-and-why-you-should-patch-it-too.md
+++
title = "I patched GSD, and why you should patch it too"
author = ["Roger Gonzalez"]
date = 2026-04-06
lastmod = 2026-04-06T21:41:55-03:00
tags = ["programming", "gsd", "claude", "opencode", "ai", "workflow"]
draft = false
+++

[GSD (Get Shit Done)](https://github.com/gsd-build/get-shit-done) is one of the best things that's happened to my development
workflow. If you haven't heard of it, it's a meta-prompting and context
engineering system for [Claude Code](https://docs.anthropic.com/en/docs/claude-code) (and [OpenCode](https://opencode.ai/)). It breaks your work into
milestones and phases, spawns fresh subagents with clean contexts for each task,
and solves the context rot problem that kills quality in long AI sessions. I
wrote about my full setup on my [AI toolbox page](/ai/).

GSD is great out of the box. But I wanted it to be _mine_.

I've been using GSD daily for weeks now, and over time I kept bumping into the
same friction points: the plan review was too shallow, the verification step was
too manual, and the UI audit felt incomplete. So I did what any developer would
do. I patched it.

This post is about the three patches I made, how they work, why I made them, and
how you can build your own. More importantly, it's about why you _should_ be
patching your tools. Not just GSD; any tool you use daily.


## The philosophy: own your tools {#the-philosophy-own-your-tools}

Here's the thing about AI tools right now: we're at a point in time where you
can design your own toolbox exactly the way you want it. Not just pick tools, but
_shape_ them. Customize them. Make them fit your brain, your workflow, your team.

GSD is open source. Its workflows are markdown files. Its commands are markdown
files. Everything is text. That means you can read them, understand them, and
rewrite the parts that don't work for you. You don't need to fork the whole
project or wait for an upstream PR to get merged. You just... change the files.

The tradeoff is that GSD updates will overwrite your changes. I'll show you how
I handle that. But first, let me show you what I changed and why.


## What I patched {#what-i-patched}

Three patches, each solving a specific pain point:

| Patch                          | Problem                                                   | Solution                                                            |
|--------------------------------|-----------------------------------------------------------|---------------------------------------------------------------------|
| Multi-model adversarial review | Stock review is shallow (5-point checklist, single model) | 6 independent AI models, 8-dimension adversarial framework          |
| Auto-verify (`--auto` flag)    | Verification is fully manual (test every item by hand)    | Automated playwright + curl checks, human only for subjective items |
| Cross-AI UI review             | Single auditor for inherently subjective UI evaluation    | 6 models independently scoring all 6 UI pillars                     |

Let's go through each one.


## Patch 1: Multi-model adversarial review {#patch-1-multi-model-adversarial-review}

This was the first patch and the one that started it all.

The stock GSD review runs a single model reviewing its own plans through a
5-point checklist. It's... fine. But after using it for a while, I noticed the
reviews were surface-level. They'd catch obvious things (missing tests, unclear
task descriptions) but they wouldn't catch architectural blind spots, failure
modes, or the kind of problems that bite you in production two weeks later.

So I replaced it with an 8-dimension adversarial review framework, executed by 6
independent AI models in parallel.


### The 6 reviewers {#the-6-reviewers}

All reviewers get the exact same prompt with the project context, phase plans,
and requirements. They review independently and don't see each other's output:

-   **GPT 5.4**, via `opencode run -m lazer/openai/gpt-5.4`
-   **Gemini 3.1 Pro**, via `opencode run -m lazer/gemini/gemini-3.1-pro-preview`
-   **MiniMax M2.5**, via `opencode run -m lazer/deepinfra/MiniMaxAI/MiniMax-M2.5`
-   **Kimi K2.5**, via `opencode run -m lazer/deepinfra/moonshotai/Kimi-K2.5-Turbo`
-   **GLM-5**, via `opencode run -m lazer/deepinfra/zai-org/GLM-5`
-   **Claude Opus**, via `claude -p --model opus`

These models are all available through [Lazer's LiteLLM proxy](https://lazertechnologies.com/) via OpenCode,
except Claude which runs through its own CLI. The key insight here is that
`opencode run -m <model>` lets you invoke _any_ model as a one-shot command,
which makes it perfect for this kind of parallel execution.


### The 8 review dimensions {#the-8-review-dimensions}

Instead of a 5-point checklist, each reviewer evaluates the plan across 8
dimensions:

1.  **Goal Alignment**: Does it actually solve the stated problem, or does it drift?
2.  **Architecture &amp; Design Coherence**: Does it fit the existing system, or fight it?
3.  **Failure Mode Analysis**: What happens when things go wrong?
4.  **Dependency &amp; Ordering Risks**: Are there hidden sequencing constraints?
5.  **Security &amp; Data Integrity**: Are new attack surfaces introduced?
6.  **Testing &amp; Verification Strategy**: Will the tests actually catch regressions?
7.  **Operational Readiness**: How will you know if it's broken in production?
8.  **Missing Pieces**: What implicit assumptions need to be explicit?

Each dimension gets a verdict: **PASS**, **FLAG** (minor concern), or **BLOCK** (must
fix before execution). With evidence and actionable recommendations, not vague
advice.

The review prompt is deliberately adversarial. It tells the reviewer:

> You are a senior staff engineer conducting a deep adversarial review. Do not be
> polite; be precise. Your job is to find what will break, what was forgotten, and
> what will cause regret in 6 months. Assume the plan authors are competent but
> blind-spotted.
