content/posts/i-patched-gsd-and-why-you-should-patch-it-too.md


### How it runs {#how-it-runs}

When you run `/gsd:review` (or `/gsd-review` in OpenCode), the workflow:

1.  Detects which CLIs are available (`opencode` and `claude`)
2.  Gathers the phase context (PROJECT.md, ROADMAP.md, PLAN.md files, REQUIREMENTS.md, etc.)
3.  Builds a structured review prompt and writes it to a temp file
4.  Invokes all 6 reviewers **in parallel**; each one gets its own bash tool call

<!--listend-->

```bash
# All run simultaneously
opencode run -m lazer/openai/gpt-5.4 "$(cat /tmp/gsd-review-prompt-4.md)" > /tmp/gsd-review-gpt-5.4-4.md
opencode run -m lazer/gemini/gemini-3.1-pro-preview "$(cat /tmp/gsd-review-prompt-4.md)" > /tmp/gsd-review-gemini-pro-4.md
opencode run -m lazer/deepinfra/MiniMaxAI/MiniMax-M2.5 "$(cat /tmp/gsd-review-prompt-4.md)" > /tmp/gsd-review-minimax-4.md
opencode run -m lazer/deepinfra/moonshotai/Kimi-K2.5-Turbo "$(cat /tmp/gsd-review-prompt-4.md)" > /tmp/gsd-review-kimi-4.md
opencode run -m lazer/deepinfra/zai-org/GLM-5 "$(cat /tmp/gsd-review-prompt-4.md)" > /tmp/gsd-review-glm-5-4.md
claude -p --model opus "$(cat /tmp/gsd-review-prompt-4.md)" > /tmp/gsd-review-claude-4.md
```

Since they run in parallel, total review time is about 1-2 minutes regardless of
how many reviewers you have. The original version ran them sequentially, which
took ~6 minutes. More on that bug below.

1.  Combines all reviews into a `REVIEWS.md` file with a consensus summary

The consensus summary is the real gem. It highlights blockers (issues raised by
2+ reviewers), agreed concerns, divergent views, and (most importantly)
**unique insights** where a single reviewer caught something all others missed.
Those blind spots are exactly why multi-model review exists.

I don't have a single dramatic "GLM-5 saved the day" story, but the pattern is
clear across multiple uses: every review has at least one or two unique insights
from a single model. Different models have different biases, different training
data, and different ways of reasoning about code. When 5 out of 6 reviewers say
PASS and one says BLOCK, that's worth investigating.

After the review, you feed it back into planning:

```nil
/gsd:plan-phase 4 --reviews
```

The planner reads the REVIEWS.md and addresses the concerns. A plan that survives
adversarial review from 6 independent AI systems is _much_ more robust than one
reviewed by a single model.


## Patch 2: Auto-verify with `--auto` {#patch-2-auto-verify-with-auto}

The stock `verify-work` workflow is fully manual: you test every single item by
hand. The workflow presents each test, you check it manually, report pass or
fail. For a phase with 10-15 tests, that's a lot of time spent clicking around
and typing "yes" over and over for things that could obviously be automated.

My patch adds an `--auto` flag. Without it, the workflow is 100% identical to
the original. With it, the workflow tries to automate the mechanical checks
before falling through to the interactive loop.

Run it like this:

```nil
/gsd:verify-work 4 --auto
```


### What `--auto` does {#what-auto-does}

1.  **Checks for `playwright-cli`.** If it's not installed, warns you and offers to
    continue without it (UI tests become manual). If it is, you get automated
    browser checks.

2.  **Auto-detects the base URL.** Scans `.env`, `PROJECT.md`, `docker-compose.yml`,
    and `package.json` for common patterns. Presents options so you can confirm or
    change.

3.  **Pings the URL.** Makes sure the app is actually running before trying to test
    anything. If it's not reachable, offers retry/skip/change URL.

4.  **Checks for auth credentials.** Looks for test tokens and credentials in `.env`
    files, test fixtures, and seed scripts. For API tests, it'll ask for a bearer
    token or API key if it can't find one. For UI tests, it'll ask for login
    credentials or use a dev bypass if one exists.

5.  **Classifies each test.** Routes tests to the right tool:

| Test references                              | Tool                         |
|----------------------------------------------|------------------------------|
| Pages, routes, visual appearance, user flows | playwright-cli               |
| API endpoints, response codes, data shapes   | curl                         |
| Form submission → API response               | playwright-cli (covers both) |
| Performance feel, subjective UX              | stays interactive            |

1.  **Runs playwright smoke checks.** For UI tests: navigates to the page, checks it
    loads without console errors, verifies key elements are visible, does basic
    click navigation. Runs `playwright-cli show` so you can watch.

2.  **Runs curl checks.** For API tests: endpoint reachability, response shape
    verification, CRUD with cleanup (create a resource, verify it, update it,
    delete it, clean up), and error handling (invalid payload → 400, missing ID →
    404).

3.  **Reports and continues.** Shows you what passed, what failed, and what needs
    manual testing. Then drops into the normal interactive loop for remaining tests
    only.


### Confidence-based failure handling {#confidence-based-failure-handling}

Not all automated failures are created equal. The patch distinguishes between
high-confidence failures and low-confidence ones:

-   **High confidence** (wrong status code, missing element, 500 error) → marked as
    issues automatically
-   **Low confidence** (timeouts, flaky selectors, intermittent network issues) →
    stays pending for manual testing

The result: I typically only need to manually verify 2-3 subjective items instead
of 10-15 total tests. It dramatically reduces UAT time while keeping the human in
the loop for things that actually need human judgment.


## Patch 3: Cross-AI UI review {#patch-3-cross-ai-ui-review}

Same concept as the adversarial plan review, but for frontend code.

GSD has a built-in UI auditor that runs a 6-pillar visual audit: Copywriting,
Visuals, Color, Typography, Spacing, and Experience Design. Each pillar gets
scored 1-4. It's useful, but it's one model's opinion about something that's
inherently subjective.

My patch adds a step after the primary audit: the same 6 external models
independently score all 6 pillars and challenge the primary auditor's findings.
The prompt explicitly tells them:

> Do not be deferential to the primary review. If you think a score is wrong, say
> so. If you think a critical issue was missed, flag it. Different eyes catch
> different things.

The result is a score comparison table appended to `UI-REVIEW.md`:

```nil
| Pillar      | Primary | GPT-5.4 | Gemini | MiniMax | Kimi | GLM-5 | Claude | Avg |
|-------------+---------+---------+--------+---------+------+-------+--------+-----|
| Copywriting |     3/4 |     3/4 |    2/4 |     3/4 |  3/4 |   3/4 |    3/4 | 2.8 |
| Visuals     |     4/4 |     3/4 |    3/4 |     4/4 |  3/4 |   4/4 |    3/4 | 3.3 |
| ...         |         |         |        |         |      |       |        |     |
```

Plus sections for: issues the primary auditor missed (caught by 2+ cross-AI
reviewers), score disagreements worth investigating, and validated findings with
high confidence.

The workflow then routes you based on severity. If there are many issues (5+
fixes, any pillar ≤ 2/4, or cross-AI average below 16/24), it tells you to fix
before moving on and suggests the right GSD command. If things look good, it
suggests proceeding to the next phase.
