posts.org
*** The patching infrastructure
:PROPERTIES:
:ID:       de1d2554-2431-4233-a988-cf452f772b76
:END:

Now for the part that makes all of this sustainable: how do the patches survive
GSD updates?

GSD's workflows live in =~/.claude/get-shit-done/workflows/= (for Claude Code)
and =~/.config/opencode/get-shit-done/workflows/= (for OpenCode). When you run
~/gsd:update~, those directories get wiped and replaced with the latest version.
Your patches are gone.

My solution is a canonical storage system. All my patch source files live in
=~/.config/gsd-patches/=, versioned in my [[https://git.rogs.me/rogs/dotfiles][dotfiles]]. After any GSD update, I
run one command to reapply everything.

**** Directory structure
:PROPERTIES:
:ID:       0ac05737-88b9-4d72-9dbf-de9814f5a04c
:END:

#+begin_src
~/.config/gsd-patches/
├── claude/
│   ├── commands/
│   │   ├── review.md          # /gsd:review command definition
│   │   └── verify-work.md     # /gsd:verify-work command definition
│   └── workflows/
│       ├── review.md          # adversarial review workflow
│       ├── ui-review.md       # cross-AI UI review workflow
│       └── verify-work.md     # auto-verify workflow
├── opencode/
│   ├── command/
│   │   ├── gsd-review.md
│   │   └── gsd-verify-work.md
│   └── workflows/
│       ├── review.md
│       ├── ui-review.md
│       └── verify-work.md
├── bin/
│   ├── sync                   # copies patches to runtime locations
│   └── check                  # verifies drift and missing files
├── gsd-customizations.md      # changelog of what changed and why
└── README.md
#+end_src

The Claude and OpenCode versions are nearly identical; the only differences are
file paths (=~/.claude/= vs =~/.config/opencode/=) and command syntax
(~/gsd:review~ vs ~/gsd-review~).

**** The sync script
:PROPERTIES:
:ID:       dde1bd1d-c76e-4dce-a6f0-937cb825a6ab
:END:

This is the entire sync script. It's embarrassingly simple:

#+begin_src bash
#!/usr/bin/env bash
set -euo pipefail

MODE="${1:-all}"
ROOT="$(cd "$(dirname "${BASH_SOURCE[0]}")/.." && pwd)"

copy_file() {
  local src="$1"
  local dst="$2"
  mkdir -p "$(dirname "$dst")"
  cp -f "$src" "$dst"
  printf 'SYNC  %s -> %s\n' "$src" "$dst"
}

sync_claude() {
  copy_file "$ROOT/claude/workflows/review.md" "$HOME/.claude/get-shit-done/workflows/review.md"
  copy_file "$ROOT/claude/workflows/ui-review.md" "$HOME/.claude/get-shit-done/workflows/ui-review.md"
  copy_file "$ROOT/claude/workflows/verify-work.md" "$HOME/.claude/get-shit-done/workflows/verify-work.md"
  copy_file "$ROOT/claude/commands/review.md" "$HOME/.claude/commands/gsd/review.md"
  copy_file "$ROOT/claude/commands/verify-work.md" "$HOME/.claude/commands/gsd/verify-work.md"
}

sync_opencode() {
  copy_file "$ROOT/opencode/workflows/review.md" "$HOME/.config/opencode/get-shit-done/workflows/review.md"
  copy_file "$ROOT/opencode/workflows/ui-review.md" "$HOME/.config/opencode/get-shit-done/workflows/ui-review.md"
  copy_file "$ROOT/opencode/workflows/verify-work.md" "$HOME/.config/opencode/get-shit-done/workflows/verify-work.md"
  copy_file "$ROOT/opencode/command/gsd-review.md" "$HOME/.config/opencode/command/gsd-review.md"
  copy_file "$ROOT/opencode/command/gsd-verify-work.md" "$HOME/.config/opencode/command/gsd-verify-work.md"
}

case "$MODE" in
  all)
    sync_claude
    sync_opencode
    ;;
  claude)
    sync_claude
    ;;
  opencode)
    sync_opencode
    ;;
  *)
    printf 'Usage: %s [all|claude|opencode]\n' "$0" >&2
    exit 2
    ;;
esac

printf 'Done.\n'
#+end_src

After a ~/gsd:update~:

#+begin_src bash
~/.config/gsd-patches/bin/sync all
#+end_src

That's it. All patches reapplied in under a second.

**** The check script
:PROPERTIES:
:ID:       f9d3f37c-8a17-44ae-9ad4-dfd466be0094
:END:

I also have a ~check~ script that verifies whether my runtime files match the
canonical source. It uses ~cmp -s~ to do a byte-for-byte comparison and reports
drift:

#+begin_src bash
~/.config/gsd-patches/bin/check all

# Output:
VERSION claude   1.30.0
VERSION opencode 1.30.0
OK      /home/roger/.claude/get-shit-done/workflows/review.md
OK      /home/roger/.claude/get-shit-done/workflows/ui-review.md
OK      /home/roger/.claude/get-shit-done/workflows/verify-work.md
OK      /home/roger/.claude/commands/gsd/review.md
OK      /home/roger/.claude/commands/gsd/verify-work.md
OK      /home/roger/.config/opencode/get-shit-done/workflows/review.md
...
Status: clean
#+end_src

If anything drifted (maybe I edited a runtime file directly during debugging),
it shows ~DIFF~ and exits with code 1. Keeps me honest.

**** The changelog
:PROPERTIES:
:ID:       5123fadc-25ee-4f82-a0d0-83181542daa9
:END:

I maintain a ~gsd-customizations.md~ file that tracks every patch: what changed,
why, which GSD version it was patched against, and which files were modified.
This is crucial. When a GSD update changes the workflow format or adds new
features, I need to know exactly what I changed so I can adapt my patches to the
new version.

Here's a taste of what it looks like:

#+begin_src markdown
## 2026-03-30 - Fix opencode hangs (remove 2>/dev/null), run reviewers in parallel

**GSD version:** 1.30.0
**Files modified:** `get-shit-done/workflows/review.md`, `get-shit-done/workflows/ui-review.md`

### What changed

- Removed `2>/dev/null` from all `opencode run` and `claude -p` invocation commands
- Changed reviewer invocation from **sequential** to **parallel**

### Why

Suppressing stderr with `2>/dev/null` caused `opencode run` to hang indefinitely;
opencode needs stderr for progress output and/or terminal detection. Removing the
redirect fixed the hangs immediately.
#+end_src

**** Honesty moment
:PROPERTIES:
:ID:       869ef699-313b-4ae9-88e1-19f97b3abe9b
:END:

I should mention: I haven't actually had a GSD update wipe my patches yet. I
haven't updated GSD since I started patching. So the sync/check system is built
and tested, but hasn't been battle-tested by a real update cycle. I'm confident
it'll work (it's just ~cp~ commands) but I want to be upfront about it. When
it does happen, I'll update this post.

*** Bugs I found along the way
:PROPERTIES:
:ID:       996920a6-663d-418e-b977-37dd8bdfffe7
:END:

Patching GSD meant reading the stock workflows carefully, and that led me to find
(and fix) bugs that existed in the original:

*~2>/dev/null~ on ~opencode run~ causes hangs.* The stock workflow suppressed
stderr on external CLI calls. Turns out, ~opencode run~ needs stderr for
progress output and/or terminal detection. Suppressing it causes the process to
hang indefinitely. Removing ~2>/dev/null~ fixed it immediately. Note: stderr
suppression on /other/ commands (like ~ls~, ~node~, ~git~) is fine; it's only
the interactive CLI tools that break.

*~claude -p~ doesn't support ~--no-input~.* The stock workflow passed
~--no-input~ to ~claude -p~, which isn't a valid flag. It caused the Claude
reviewer to fail silently (exit code 1, empty output). Just removing the flag
fixed it.

*Sequential execution was unnecessary.* The stock workflow ran reviewers one at
a time. Since each reviewer is an independent process with no shared state,
there's no reason they can't run in parallel. Switching to parallel execution
(separate bash tool calls in a single message) cut review time from ~6 minutes
to ~1-2 minutes.

These fixes are now part of my patches and would benefit anyone patching GSD.

